Revit 2026 API

# ZoneDehumidificationSetPoint Property

---

**Note: This API is now obsolete.**

Get or set the DeHumidification Set Point of the Zone.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone and SystemZoneElementType objects instead.")]
public double DehumidificationSetPoint { get; set; }
```
```vb
<ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone and SystemZoneElementType objects instead.")>
Public Property DehumidificationSetPoint As Double
	Get
	Set
```
```cpp
public:
[ObsoleteAttribute(L"This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone and SystemZoneElementType objects instead.")]
property double DehumidificationSetPoint {
	double get ();
	void set (double value);
}
```
```fsharp
[<ObsoleteAttribute("This property is deprecated in Revit 2026 and may be removed in a future version of Revit. Please use the GenericZone and SystemZoneElementType objects instead.")>]
member DehumidificationSetPoint : float with get, set
```

#### Property Value

Double

This property is used to get or set the DeHumidification Set Point of the Zone.

#### Reference

Zone Class

Autodesk.Revit.DB.Mechanical Namespace